# Connection to Local DB

This is for local set up containing some 'SQL' scripts for creating tables and updating/inserting elements into the table

In [2]:
%load_ext sql

In [3]:
# Input your local username and password for connection
db_user = "root"
db_password = "zzzz2222"
connection_string_template = "mysql+pymysql://{db_user}:{db_password}@localhost"
connection_string = connection_string_template.format(db_user=db_user, db_password=db_password)
%sql $connection_string

# Initial Database Setup

In [4]:
%%sql 
create schema if not exists teammate_db;
select 'success';

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[('success',)]

In [5]:
%%sql 
use teammate_db;
select 'success';

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[('success',)]

In [6]:
%%sql 
drop table if exists teammate_db.StudentsProfile;
select 'success';

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[('success',)]

In [7]:
%%sql 
drop table if exists teammate_db.Team;
select 'success';

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[('success',)]

In [8]:
%%sql 
drop table if exists teammate_db.StudentsInTeam;
select 'success';

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[('success',)]

## Team
create table named Team containing variables:
- Team_Name
- Team_id
- Course_id
- Number_needed
- Team_Captain

In [10]:
%%sql 
create table if not exists teammate_db.Team
(
    Team_id int not null AUTO_INCREMENT Primary key,
    Team_Name varchar(128) not null,
    Team_Captain_Uni varchar(20) not null,
    Team_Captain varchar(128) not null,
    Course_id int not null,
    Number_needed int,
    Team_message varchar(128) not null
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [11]:
%%sql 
insert into teammate_db.Team (Team_name, Team_Captain_Uni, Team_Captain, Course_id, Number_needed, Team_message) values
("6156_team", "xc2597", "Xiaowei Chen", 1, 1, "hello"),
("we are the best", "yr2425", "Yue Rao", 1, 4, "let do it"),
("4111_team", "yr2425", "Yue Rao", 2, 0, "Full")

 * mysql+pymysql://root:***@localhost
3 rows affected.

[]

In [12]:
%sql describe teammate_db.Team

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('Team_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Team_Name', 'varchar(128)', 'NO', '', None, ''),
 ('Team_Captain_Uni', 'varchar(20)', 'NO', '', None, ''),
 ('Team_Captain', 'varchar(128)', 'NO', '', None, ''),
 ('Course_id', 'int', 'NO', '', None, ''),
 ('Number_needed', 'int', 'YES', '', None, ''),
 ('Team_message', 'varchar(128)', 'NO', '', None, '')]

In [13]:
%sql select * from teammate_db.Team;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[(1, '6156_team', 'xc2597', 'Xiaowei Chen', 1, 1, 'hello'),
 (2, 'we are the best', 'yr2425', 'Yue Rao', 1, 4, 'let do it'),
 (3, '4111_team', 'yr2425', 'Yue Rao', 2, 0, 'Full')]

## StudentsInTeam
create table named StudentsInTeam containing variables:
- Uni
- Team_id
- Course_id

In [30]:
%%sql 
create table if not exists teammate_db.StudentsInTeam
(
    Uni varchar(20),
    Student_Name varchar(20),
    Course_id int,
    Team_id int,
    Constraint pk primary key (Uni, Team_id),
    Constraint team_id Foreign key (Team_id) references Team(Team_id) on delete no action
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [31]:
%%sql 
insert into teammate_db.StudentsInTeam (Uni, Student_Name, Course_id, Team_id) values
 ("aw3395", "Anshuo", 1, 1),
 ("xc2597", "XiaoWei", 1, 1),
 ("yr2425", "Yue", 1, 2),
 ("hl3445", "Haochen", 2, 3),
 ("bh2798", "Bowen", 2, 3)

 * mysql+pymysql://root:***@localhost
5 rows affected.

[]

In [33]:
%sql describe teammate_db.StudentsInTeam

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('Uni', 'varchar(20)', 'NO', 'PRI', None, ''),
 ('Student_Name', 'varchar(20)', 'YES', '', None, ''),
 ('Course_id', 'int', 'YES', '', None, ''),
 ('Team_id', 'int', 'NO', 'PRI', None, '')]

In [34]:
%sql select * from teammate_db.StudentsInTeam;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('aw3395', 'Anshuo', 1, 1),
 ('bh2798', 'Bowen', 2, 3),
 ('hl3445', 'Haochen', 2, 3),
 ('xc2597', 'XiaoWei', 1, 1),
 ('yr2425', 'Yue', 1, 2)]